# Задание 1
# s1 = "I am learning Python. hello, WORLD!"
# first = s1.find("h")
# last = s1.rfind("h")
# z = s1[:first] + s1[last+1:]
# print(z)

# Задание 2
# s1 = "I am learning Python. hello, WORLD!"
# first = s1.find("h")
# last = s1.rfind("h")
# z = s1[:first] + s1[last: first-1: -1] + s1[last+1:]
# print(z)

# Задание 3
# x = input("Введите строку: ")
# y = input("Введите подстроку, которую нужно заменить: ")
# z = input("Введите новую подстроку: ")
# new_x = x.replace(y, z)
# print(new_x)

# Задание 4
# txt = " Ежевику для ежат\n Принесли два ежа.\n Ежевику еле-еле\n Ежата возле ели съели."
# counter = 0
# arr = txt.split(" ")
# for i in arr:
#     if i.find("е") == 0 or i.find("Е") == 0:
#         counter +=1
# print(txt)
# print("Количество слов на букву Е: ", counter)







